In [1]:
#importing necessary library
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

import warnings
warnings.filterwarnings('ignore')

%matplotlib inline

In [5]:
#read csv file
titanic = pd.read_csv("titanic.csv")

In [7]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,8.0500,S

In [8]:
#check how many unique values in a column
titanic["Pclass"].nunique()

3

In [10]:
#get the number of people (Survived = 1 is survived person)
titanic["Survived"].sum()

342

In [11]:
# use groupby function to group data into group base on Pclass
titanic_class = titanic.groupby("Pclass")

In [14]:
# only get the group of Pclass = 1
titanic_class.get_group(2) # 2 here is value in titanic Pclass, not index

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,0,30.0708,C
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,16.0000,S
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,13.0000,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,26.0000,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,13.0000,S
...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,0,13.8583,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,0,24.0000,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,26.0000,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,10.5000,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,13.0000,S

In [15]:
#Aggregate

In [18]:
# how many people survive per class
titanic_class["Survived"].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [20]:
# average age of people from different class
titanic_class["Age"].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [24]:
# max ticket fare paid
titanic_class.max()

,PassengerId,Survived,Name,Sex,Age,Parch,Fare
Pclass,,,,,,,
1,890,1,"Young, Miss. Marie Grice",male,80.0,4,512.3292
2,887,1,"del Carlo, Mr. Sebastiano",male,70.0,3,73.5000
3,891,1,"van Melkebeke, Mr. Philemon",male,74.0,6,69.5500

In [31]:
# multiple aggregate at once
titanic_class.agg({"Fare": ["sum", "count", "max"]})

              Fare
               sum count       max
Pclass
1       18177.4125   216  512.3292
2        3801.8417   184   73.5000
3        6714.6951   491   69.5500

In [32]:
#Filter data with group by: take only parts of the data base on condition
#Transform data with group by: transfrom full set of data into another form

In [33]:
#1. Filter

In [35]:
# What is the average fare when a group has its average age greater than 38?
titanic_class.filter(lambda x: x["Age"].mean() > 38.0)

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,71.2833,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,53.1000,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,51.8625,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,26.5500,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,35.5000,S
...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,52.5542,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,5.0000,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1,83.1583,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,30.0000,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,30.0000,C

In [36]:
titanic_class.filter(lambda x: x["Age"].mean() < 38.0)

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,7.2500,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,7.9250,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,8.0500,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,8.4583,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,1,21.0750,S
...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,7.0500,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,5,29.1250,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,13.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,2,23.4500,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,7.7500,Q

In [38]:
# Get the average fare for group with age > 38 anf group with age < 38
print(titanic_class.filter(lambda x: x["Age"].mean() > 38.0)["Fare"].mean())
print(titanic_class.filter(lambda x: x["Age"].mean() < 38.0)["Fare"].mean())

84.1546875
15.580054518518516

In [39]:
# Transfom data

In [41]:
# Which of the passengers paid a fare that is higher than the average for their ticket class?
# create a new column name average_fare_class to set the avarage fare of each class for every guests
titanic["average_fare_class"] = titanic.groupby("Pclass")["Fare"].transform(lambda x: x.mean())

In [42]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked,average_fare_class
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,7.2500,S,13.675550
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,71.2833,C,84.154687
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,7.9250,S,13.675550
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,53.1000,S,84.154687
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,8.0500,S,13.675550
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,13.0000,S,20.662183
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,30.0000,S,84.154687
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,2,23.4500,S,13.675550
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,30.0000,C,84.154687
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,7.7500,Q,13.675550

In [50]:
#create a new column, assign True if fare above average or False if vice versa
titanic["fare_above_avg"] = titanic["Fare"] > titanic["average_fare_class"]

In [56]:
#count how many True and False in column fare_above_avg
titanic_fare = titanic.groupby("fare_above_avg").count()

In [59]:
titanic_fare

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked,average_fare_class
fare_above_avg,,,,,,,,,,
False,593,593,593,593,593,467,593,593,591,593
True,298,298,298,298,298,247,298,298,298,298

In [60]:
#Group multiple index data

In [61]:
#get only the first 3 rows of the data frame
titanic.loc[:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked,average_fare_class,fare_above_avg
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,7.2500,S,13.675550,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,71.2833,C,84.154687,False
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,7.9250,S,13.675550,False

In [64]:
#setting names and sex as indices
titanic_multi = titanic.set_index(["Sex", "Embarked","fare_above_avg"])

In [65]:
titanic_multi.head() #now the sex and embarked column is index, replace to original index

                                PassengerId  Survived  Pclass  \
Sex    Embarked fare_above_avg
male   S        False                     1         0       3
female C        False                     2         1       1
       S        False                     3         1       3
                False                     4         1       1
male   S        False                     5         0       3

                                                                             Name  \
Sex    Embarked fare_above_avg
male   S        False                                     Braund, Mr. Owen Harris
female C        False           Cumings, Mrs. John Bradley (Florence Briggs Th...
       S        False                                      Heikkinen, Miss. Laina
                False                Futrelle, Mrs. Jacques Heath (Lily May Peel)
male   S        False                                    Allen, Mr. William Henry

                                 Age  Parch     Fare  average_fare_class
Sex    Embarked fare_above_avg
male   S        False           22.0      0   7.2500           13.675550
female C        False           38.0      0  71.2833           84.154687
       S        False           26.0      0   7.9250           13.675550
                False           35.0      0  53.1000           84.154687
male   S        False           35.0      0   8.0500           13.675550

In [67]:
#group by using 2 columns
tita_df = titanic_multi.groupby(["Sex", "Embarked"]).mean()

In [68]:
tita_df

                 PassengerId  Survived    Pclass        Age     Parch  \
Sex    Embarked
female C          437.315068  0.876712  1.726027  28.344262  0.493151
       Q          374.138889  0.750000  2.888889  24.291667  0.222222
       S          438.709360  0.689655  2.197044  27.771505  0.788177
male   C          451.536842  0.305263  2.010526  32.998841  0.263158
       Q          456.317073  0.073171  2.926829  30.937500  0.121951
       S          454.507937  0.174603  2.421769  30.291440  0.240363

                      Fare  average_fare_class
Sex    Embarked
female C         75.169805           55.860610
       Q         12.634958           16.021450
       S         38.740929           32.646501
male   C         48.262109           45.570183
       Q         13.838922           15.564959
       S         21.711996           27.837807

In [69]:
#filter rows base on condition
display(titanic[titanic["Age"] > 30])

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked,average_fare_class,fare_above_avg
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,71.2833,C,84.154687,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,0,53.1000,S,84.154687,False
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,8.0500,S,13.675550,False
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,51.8625,S,84.154687,False
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,26.5500,S,84.154687,False
...,...,...,...,...,...,...,...,...,...,...,...
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,9.0000,S,13.675550,False
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,1,83.1583,C,84.154687,False
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,7.8958,S,13.675550,False
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,5,29.1250,Q,13.675550,True
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,7.7500,Q,13.675550,False

In [70]:
#get only the people with fare higher than average
display(titanic[titanic["fare_above_avg"] == True])

,PassengerId,Survived,Pclass,Name,Sex,Age,Parch,Fare,Embarked,average_fare_class,fare_above_avg
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,1,21.0750,S,13.675550,True
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,0,30.0708,C,20.662183,True
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,16.7000,S,13.675550,True
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,5,31.2750,S,13.675550,True
16,17,0,3,"Rice, Master. Eugene",male,2.0,1,29.1250,Q,13.675550,True
...,...,...,...,...,...,...,...,...,...,...,...
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,2,69.5500,S,13.675550,True
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,0,24.0000,C,20.662183,True
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,26.0000,S,20.662183,True
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,5,29.1250,Q,13.675550,True
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,2,23.4500,S,13.675550,True